ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_i2c.c
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_GENERAL_CALL(I2C_InitStruct->I2C_GeneralCall));
  Assert_Param(IS_I2C_ACKNOWLEDGE_ADDRESS(I2C_InitStruct->I2C_AddressingMode));
  Assert_Param(IS_I2C_ACKNOWLEDGE(I2C_InitStruct->I2C_Acknowledge));
  Assert_Param(IS_I2C_ADDRESS(I2C_InitStruct->I2C_OwnAddress));
  Assert_Param(IS_I2C_SPEED(I2C_InitStruct->I2C_Speed));
  #if (LIBCFG_I2C_NOSTRETCH)
  Assert_Param(IS_I2C_STRETCH(I2C_InitStruct->I2C_StretchMode));

  if (I2C_InitStruct->I2C_StretchMode == I2C_STRETCH_BYPASSADRS || I2C_InitStruct->I2C_StretchMode == I2C_STRETCH_NO)
  {
    I2Cx->CR = (I2Cx->CR & 0xFFFFFF1A) | I2C_InitStruct->I2C_GeneralCall | I2C_InitStruct->I2C_StretchMode |
               I2C_InitStruct->I2C_AddressingMode | I2C_InitStruct->I2C_Acknowledge;
  }
  else
  #endif
  {
    I2Cx->CR = (I2Cx->CR & 0xFFFFFF7A) | I2C_InitStruct->I2C_GeneralCall |
               I2C_InitStruct->I2C_AddressingMode | I2C_InitStruct->I2C_Acknowledge;
  }

  I2Cx->ADDR = I2C_InitStruct->I2C_OwnAddress;

  if (I2Cx == HT_I2C0)
    PCLK_I2Cx = CKCU_PCLK_I2C0;
  #if (LIBCFG_I2C1)
  else if (I2Cx == HT_I2C1)
    PCLK_I2Cx = CKCU_PCLK_I2C1;
  #endif
  #if (LIBCFG_I2C2)
  else if (I2Cx == HT_I2C2)
    PCLK_I2Cx = CKCU_PCLK_I2C2;
  #endif
  PCLK_Freq = CKCU_GetPeripFrequency(PCLK_I2Cx);

  SEQ_FILTER = I2Cx->CR & CR_SEQ_FILTER_Msk;
  if (SEQ_FILTER == SEQ_FILTER_DISABLE)
  {
    sTmp = 6;
  }
  else
  {
    sTmp = 7 + (SEQ_FILTER >> 14);
  }

  SHPGR = (PCLK_Freq * 9)/(I2C_InitStruct->I2C_Speed * 20) - sTmp - I2C_InitStruct->I2C_SpeedOffset;
  SLPGR = (PCLK_Freq * 11)/(I2C_InitStruct->I2C_Speed * 20) - sTmp - I2C_InitStruct->I2C_SpeedOffset;

  #if (LIBCFG_I2C_SHLPGR_OVF_FIX)
    #if 0 /* Default disabled */
    {
      u32 i = 1;
      while ((SHPGR > 255) || (SLPGR > 255))
      {
        /* !!! NOTICE !!!
           Following code depend on the CKCU_APBCLKPRE_DIVn is 0, 1, 2, 3.
        */
        CKCU_SetPeripPrescaler(PCLK_I2Cx, (CKCU_APBCLKPRE_TypeDef)(CKCU_APBCLKPRE_DIV1 + i));

        PCLK_Freq = CKCU_GetPeripFrequency(PCLK_I2Cx);

        SHPGR = (PCLK_Freq * 9)/(I2C_InitStruct->I2C_Speed * 20) - sTmp - I2C_InitStruct->I2C_SpeedOffset;
        SLPGR = (PCLK_Freq * 11)/(I2C_InitStruct->I2C_Speed * 20) - sTmp - I2C_InitStruct->I2C_SpeedOffset;

        i++;
        if (i == 4)
        {
          break;
        }
      }
    }
    #endif
  #endif

  #if LIBCFG_I2C_SHLPGR_8BIT
  /* If SHPGR or SLPGR exceeds the 8-bit maximum value (255), it means the current                        */
  /* PCLK is too high, causing the calculated timing parameters to overflow the 8-bit registers.          */
  if((SHPGR > 255) || (SLPGR > 255))
  {
      return ERROR;
  }
  #endif

  if ((SHPGR < 0) || (SLPGR < 0))
  {
    return ERROR;
  }

  I2Cx->SHPGR = SHPGR;
  I2Cx->SLPGR = SLPGR;

  return SUCCESS;
}

/*********************************************************************************************************//**
 * @brief Fill each I2C_InitStruct member with its default value.
 * @param I2C_InitStruct: pointer to an I2C_InitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void I2C_StructInit(I2C_InitTypeDef* I2C_InitStruct)
{
  I2C_InitStruct->I2C_GeneralCall = I2C_GENERALCALL_DISABLE;
  I2C_InitStruct->I2C_AddressingMode = I2C_ADDRESSING_7BIT;
  I2C_InitStruct->I2C_Acknowledge = I2C_ACK_DISABLE;
  I2C_InitStruct->I2C_OwnAddress = 0;
  I2C_InitStruct->I2C_Speed = 1000000;
  I2C_InitStruct->I2C_SpeedOffset = 0;
  #if (LIBCFG_I2C_NOSTRETCH)
  I2C_InitStruct->I2C_StretchMode = I2C_STRETCH_YES;
  #endif
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the specified I2C peripheral.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void I2C_Cmd(HT_I2C_TypeDef* I2Cx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    I2Cx->CR |= CR_ENI2C_SET;
  }
  else
  {
    I2Cx->CR &= CR_ENI2C_RESET;
  }
}

/*********************************************************************************************************//**
 * @brief Generate STOP condition of I2C communication.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @retval None
 ************************************************************************************************************/
void I2C_GenerateSTOP(HT_I2C_TypeDef* I2Cx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));

  I2Cx->CR |= 0x2;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable I2C interrupts.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param I2C_Int: specify if the I2C interrupt source to be enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg I2C_INT_STA
 *     @arg I2C_INT_STO
 *     @arg I2C_INT_ADRS
 *     @arg I2C_INT_GCS
 *     @arg I2C_INT_OVR
 *     @arg I2C_INT_ARBLOS
 *     @arg I2C_INT_RXNACK
 *     @arg I2C_INT_BUSERR
 *     @arg I2C_INT_TOUT
 *     @arg I2C_INT_RXDNE
 *     @arg I2C_INT_TXDE
 *     @arg I2C_INT_RXBF
 *     @arg I2C_INT_ALL
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void I2C_IntConfig(HT_I2C_TypeDef* I2Cx, u32 I2C_Int, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_INT(I2C_Int));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    I2Cx->IER |= I2C_Int;
  }
   else
  {
    I2Cx->IER &= (u32)~I2C_Int;
  }
}

