ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_i2c.c
/*********************************************************************************************************//**
 * @brief Enable or Disable I2C General Call.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void I2C_GeneralCallCmd(HT_I2C_TypeDef* I2Cx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    I2Cx->CR |= CR_ENGC_SET;
  }
  else
  {
    I2Cx->CR &= CR_ENGC_RESET;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable I2C sending acknowledgement.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void I2C_AckCmd(HT_I2C_TypeDef* I2Cx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    I2Cx->CR |= CR_ACK_SET;
  }
  else
  {
    I2Cx->CR &= CR_ACK_RESET;
  }
}

/*********************************************************************************************************//**
 * @brief Configure own address of the specified I2C.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param I2C_Address: specify own address of I2C.
 * @retval None
 ************************************************************************************************************/
void I2C_SetOwnAddress(HT_I2C_TypeDef* I2Cx, I2C_AddressTypeDef I2C_Address)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_ADDRESS(I2C_Address));

  I2Cx->ADDR = I2C_Address;
}

/*********************************************************************************************************//**
 * @brief Start transmitting to target slave address.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param I2C_Address: specify the slave address which will be transmitted.
 * @param I2C_Direction: This parameter can be I2C_MASTER_READ or I2C_MASTER_WRITE.
 * @retval None
 ************************************************************************************************************/
void I2C_TargetAddressConfig(HT_I2C_TypeDef* I2Cx, I2C_AddressTypeDef I2C_Address, u32 I2C_Direction)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_ADDRESS(I2C_Address));
  Assert_Param(IS_I2C_DIRECTION(I2C_Direction));

  /* Make sure the prior stop command has been finished                                                     */
  while (I2Cx->CR & 0x2);

  if (I2C_Direction != I2C_MASTER_WRITE)
  {
    I2Cx->TAR = I2C_Address | I2C_MASTER_READ;
  }
   else
  {
    I2Cx->TAR = I2C_Address | I2C_MASTER_WRITE;
  }
}

/*********************************************************************************************************//**
 * @brief Send a data word through the I2Cx peripheral.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param I2C_Data: Byte to be transmitted.
 * @retval None
 ************************************************************************************************************/
void I2C_SendData(HT_I2C_TypeDef* I2Cx, u8 I2C_Data)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  #if (LIBCFG_I2C_NOSTRETCH)
  I2Cx->TXDR = I2C_Data;
  #else
  I2Cx->DR = I2C_Data;
  #endif
}

/*********************************************************************************************************//**
 * @brief Return the received data by the I2Cx peripheral.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @retval The value of the received data.
 ************************************************************************************************************/
u8 I2C_ReceiveData(HT_I2C_TypeDef* I2Cx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  #if (LIBCFG_I2C_NOSTRETCH)
  return (u8)I2Cx->RXDR;
  #else
  return (u8)I2Cx->DR;
  #endif
}

/*********************************************************************************************************//**
 * @brief Read the specified I2C register and returns its value.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param I2C_Register: specify the register to read.
 *   This parameter can be one of the following values:
 *     @arg I2C_REGISTER_CR    : Control Register
 *     @arg I2C_REGISTER_IER   : Interrupt Enable Register
 *     @arg I2C_REGISTER_ADDR  : Address Register
 *     @arg I2C_REGISTER_SR    : Status Register
 *     @arg I2C_REGISTER_SHPGR : SCL High Period Generation Register
 *     @arg I2C_REGISTER_SLPGR : SCL Low Period Generation Register
 *     @arg I2C_REGISTER_DR    : Data Register
 *     @arg I2C_REGISTER_TAR   : Target Register
 * @retval None
 ************************************************************************************************************/
u32 I2C_ReadRegister(HT_I2C_TypeDef* I2Cx, u8 I2C_Register)
{
  vu32 tmp = 0;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_REGISTER(I2C_Register));

  tmp = (u32)I2Cx;
  tmp += I2C_Register;
  return (*(u32 *)tmp);
}

