ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_i2c.c
/*********************************************************************************************************//**
 * @brief Check whether the specified I2C flag has been set.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param I2C_Flag: specify the flag to be check.
 *   This parameter can be one of the following values:
 *     @arg I2C_FLAG_STA     : I2C start condition transmitted flag (Master mode)
 *     @arg I2C_FLAG_STO     : I2C stop condition detected flag (Slave flag)
 *     @arg I2C_FLAG_ADRS    : I2C address flag
 *     @arg I2C_FLAG_GCS     : I2C general call flag (Slave mode)
 *     @arg I2C_FLAG_OVR     : I2C overrun/underrun flag
 *     @arg I2C_FLAG_ARBLOS  : I2C arbitration loss flag (Master mode)
 *     @arg I2C_FLAG_RXNACK  : I2C received not acknowledge flag
 *     @arg I2C_FLAG_BUSERR  : I2C bus error flag
 *     @arg I2C_FLAG_RXDNE   : I2C Rx data not empty flag
 *     @arg I2C_FLAG_TXDE    : I2C Tx data empty flag
 *     @arg I2C_FLAG_RXBF    : I2C RX buffer full flag
 *     @arg I2C_FLAG_BUSBUSY : I2C bus busy flag
 *     @arg I2C_FLAG_MASTER  : I2C master mode flag (Master flag)
 *     @arg I2C_FLAG_TXNRX   : I2C transmitter mode flag
 * @retval SET or RESET
 ************************************************************************************************************/
FlagStatus I2C_GetFlagStatus(HT_I2C_TypeDef* I2Cx, u32 I2C_Flag)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_FLAG(I2C_Flag));

  if ((I2Cx->SR & I2C_Flag) != (u32)RESET)
  {
    return (SET);
  }
  else
  {
    return (RESET);
  }
}

/*********************************************************************************************************//**
 * @brief Check whether the specified I2C status has been active.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param I2C_Status: specify the flag that is to be check.
 *   This parameter can be one of the following values:
 *     @arg I2C_MASTER_SEND_START
 *     @arg I2C_MASTER_RECEIVER_MODE
 *     @arg I2C_MASTER_TRANSMITTER_MODE
 *     @arg I2C_MASTER_RX_NOT_EMPTY
 *     @arg I2C_MASTER_RX_NOT_EMPTY_NOBUSY
 *     @arg I2C_MASTER_TX_EMPTY
 *     @arg I2C_MASTER_RX_BUFFER_FULL
 *     @arg I2C_SLAVE_ACK_TRANSMITTER_ADDRESS
 *     @arg I2C_SLAVE_ACK_RECEIVER_ADDRESS
 *     @arg I2C_SLAVE_ACK_GCALL_ADDRESS
 *     @arg I2C_SLAVE_RX_NOT_EMPTY
 *     @arg I2C_SLAVE_RX_NOT_EMPTY_STOP
 *     @arg I2C_SLAVE_TX_EMPTY
 *     @arg I2C_SLAVE_RX_BUFFER_FULL
 *     @arg I2C_SLAVE_RECEIVED_NACK
 *     @arg I2C_SLAVE_RECEIVED_NACK_STOP
 *     @arg I2C_SLAVE_STOP_DETECTED
 * @retval SUCCESS or ERROR
 ************************************************************************************************************/
ErrStatus I2C_CheckStatus(HT_I2C_TypeDef* I2Cx, u32 I2C_Status)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_STATUS(I2C_Status));

  if (I2Cx->SR == I2C_Status)
  {
    return (SUCCESS);
  }
  else
  {
    return (ERROR);
  }
}

/*********************************************************************************************************//**
 * @brief Clear the specified I2C flag.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param I2C_Flag: specify the flag that is to be cleared.
 *   This parameter can be one of the following values:
 *     @arg I2C_FLAG_ARBLOS : I2C arbitration flag
 *     @arg I2C_FLAG_RXNACK : I2C receive not acknowledge flag
 *     @arg I2C_FLAG_BUSERR : I2C Bus error flag
 * @retval None
 ************************************************************************************************************/
void I2C_ClearFlag(HT_I2C_TypeDef* I2Cx, u32 I2C_Flag)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_CLEAR_FLAG(I2C_Flag));

  I2Cx->SR = I2C_Flag;
}

/*********************************************************************************************************//**
 * @brief Set the interval timing of the high period of the I2C clock.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param I2C_HighPeriod: specify the high period that is to be set.
 *   This parameter must be a number between 0 and 0xFFFF.
 * @retval None
 ************************************************************************************************************/
void I2C_SetSCLHighPeriod(HT_I2C_TypeDef* I2Cx, u32 I2C_HighPeriod)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_SCL_HIGH(I2C_HighPeriod));

  I2Cx->SHPGR = I2C_HighPeriod;
}

/*********************************************************************************************************//**
 * @brief Set the interval timing of low period of the I2C clock.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param I2C_LowPeriod: specify the low period that is to be set.
 *   This parameter must be a number between 0 and 0xFFFF.
 * @retval None
 ************************************************************************************************************/
void I2C_SetSCLLowPeriod(HT_I2C_TypeDef* I2Cx, u32 I2C_LowPeriod)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_SCL_LOW(I2C_LowPeriod));

  I2Cx->SLPGR = I2C_LowPeriod;
}

#if (LIBCFG_PDMA)
/*********************************************************************************************************//**
 * @brief Enable or Disable the I2Cx PDMA interface.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param I2C_PDMAREQ: specify the I2C PDMA transfer request to be enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg I2C_PDMAREQ_TX: Tx PDMA transfer request
 *     @arg I2C_PDMAREQ_RX: Rx PDMA transfer request
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void I2C_PDMACmd(HT_I2C_TypeDef* I2Cx, u32 I2C_PDMAREQ, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_PDMA_REQ(I2C_PDMAREQ));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    I2Cx->CR |= I2C_PDMAREQ;
  }
  else
  {
    I2Cx->CR &= ~I2C_PDMAREQ;
  }
}

