ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_i2c.c
/*********************************************************************************************************//**
 * @brief Specify that the next PDMA transfer is the last one.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void I2C_PDMANACKCmd(HT_I2C_TypeDef* I2Cx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    I2Cx->CR |= CR_PDMANACK_SET;
  }
  else
  {
    I2Cx->CR &= CR_PDMANACK_RESET;
  }
}
#endif

/*********************************************************************************************************//**
 * @brief Enable or Disable the specified I2C time out function.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void I2C_TimeOutCmd(HT_I2C_TypeDef* I2Cx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    I2Cx->CR |= CR_ENTOUT_SET;
  }
  else
  {
    I2Cx->CR &= CR_ENTOUT_RESET;
  }
}

/*********************************************************************************************************//**
 * @brief This function is used to set the I2C timeout value.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param I2C_Timeout: specify the timeout value.
 * @retval None
 ************************************************************************************************************/
void I2C_SetTimeOutValue(HT_I2C_TypeDef* I2Cx, u32 I2C_Timeout)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_TIMEOUT(I2C_Timeout));

  I2Cx->TOUT = (I2C_Timeout | (I2Cx->TOUT & 0xFFFF0000));
}

/*********************************************************************************************************//**
 * @brief This function is used to set the prescaler of I2C timeout value.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param I2C_Prescaler: specify the I2C time out prescaler value.
 *   This parameter can be one of the following values:
 *     @arg I2C_PRESCALER_1   : I2C prescaler set to 1
 *     @arg I2C_PRESCALER_2   : I2C prescaler set to 2
 *     @arg I2C_PRESCALER_4   : I2C prescaler set to 4
 *     @arg I2C_PRESCALER_16  : I2C prescaler set to 16
 *     @arg I2C_PRESCALER_32  : I2C prescaler set to 32
 *     @arg I2C_PRESCALER_64  : I2C prescaler set to 64
 *     @arg I2C_PRESCALER_128 : I2C prescaler set to 128
 * @retval None
 ************************************************************************************************************/
void I2C_SetTimeOutPrescaler(HT_I2C_TypeDef* I2Cx, u32 I2C_Prescaler)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_PRESCALER(I2C_Prescaler));

  I2Cx->TOUT = (I2C_Prescaler | (I2Cx->TOUT & 0x0000FFFF));
}

/*********************************************************************************************************//**
 * @brief This function is used to determine the prescaler of I2C timeout value.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param I2C_Mask: specify the bit position of I2C slave address to be masked.
 *   This parameter can be any combination of the following values:
 *     @arg I2C_MASKBIT_0 : Bit 0 of I2C slave address is masked
 *     @arg I2C_MASKBIT_1 : Bit 1 of I2C slave address is masked
 *     @arg I2C_MASKBIT_2 : Bit 2 of I2C slave address is masked
 *     @arg I2C_MASKBIT_3 : Bit 3 of I2C slave address is masked
 *     @arg I2C_MASKBIT_4 : Bit 4 of I2C slave address is masked
 *     @arg I2C_MASKBIT_5 : Bit 5 of I2C slave address is masked
 *     @arg I2C_MASKBIT_6 : Bit 6 of I2C slave address is masked
 *     @arg I2C_MASKBIT_7 : Bit 7 of I2C slave address is masked
 *     @arg I2C_MASKBIT_8 : Bit 8 of I2C slave address is masked
 *     @arg I2C_MASKBIT_9 : Bit 9 of I2C slave address is masked
 * @retval None
 ************************************************************************************************************/
void I2C_AddressMaskConfig(HT_I2C_TypeDef* I2Cx, u32 I2C_Mask)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_ADDRESS_MASK(I2C_Mask));

  I2Cx->ADDMR = I2C_Mask;
}

/*********************************************************************************************************//**
 * @brief Return the received address by the I2Cx peripheral.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @retval The value of the received address.
 ************************************************************************************************************/
u16 I2C_GetAddressBuffer(HT_I2C_TypeDef* I2Cx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));

  return ((u16)I2Cx->ADDSR);
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the combinational filter.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void I2C_CombFilterCmd(HT_I2C_TypeDef* I2Cx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    I2Cx->CR |= CR_COMBFILTER_SET;
  }
  else
  {
    I2Cx->CR &= CR_COMBFILTER_RESET;
  }
}

