ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_i2c.c
/*********************************************************************************************************//**
 * @brief This function is used to determine the filter glitch width of 0~2(3~7) PCLK.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param Seq_Filter_Select: specify the glitch width of 0~2(3~7) PCLK.
 *   This parameter can be any combination of the following values:
 *     @arg SEQ_FILTER_DISABLE : sequential filter is disabled
 *     @arg SEQ_FILTER_1_PCLK  : filter glitch width of 1 PCLK
 *     @arg SEQ_FILTER_2_PCLK  : filter glitch width of 2 PCLK
 *     @arg SEQ_FILTER_3_PCLK  : filter glitch width of 3 PCLK
 *     @arg SEQ_FILTER_4_PCLK  : filter glitch width of 4 PCLK
 *     @arg SEQ_FILTER_5_PCLK  : filter glitch width of 5 PCLK
 *     @arg SEQ_FILTER_6_PCLK  : filter glitch width of 6 PCLK
 *     @arg SEQ_FILTER_7_PCLK  : filter glitch width of 7 PCLK
 * @retval None
 ************************************************************************************************************/
void I2C_SequentialFilterConfig(HT_I2C_TypeDef* I2Cx, u32 Seq_Filter_Select)
{
  u32 SHPGR = I2Cx->SHPGR;
  u32 SLPGR = I2Cx->SLPGR;
  u32 SEQ_FILTER = I2Cx->CR & CR_SEQ_FILTER_Msk;
  u32 PGR_VALUE;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_SEQ_FILTER_MASK(Seq_Filter_Select));

  if (SEQ_FILTER < Seq_Filter_Select)
  {
    PGR_VALUE = (Seq_Filter_Select - SEQ_FILTER) >> 14;
    if (SEQ_FILTER == SEQ_FILTER_DISABLE)
    {
      PGR_VALUE += 1;
    }
    if (SHPGR >= PGR_VALUE)
    {
      SHPGR -= PGR_VALUE;
      SLPGR -= PGR_VALUE;
    }
    else
    {
      SHPGR = 0;
      SLPGR = 0;
    }
  }
  else if (SEQ_FILTER > Seq_Filter_Select)
  {
    PGR_VALUE = (SEQ_FILTER - Seq_Filter_Select) >> 14;
    if (Seq_Filter_Select == SEQ_FILTER_DISABLE)
    {
      PGR_VALUE += 1;
    }
    SHPGR += PGR_VALUE;
    SLPGR += PGR_VALUE;
  }

  I2Cx->SHPGR = SHPGR;
  I2Cx->SLPGR = SLPGR;
  I2Cx->CR = (I2Cx->CR & ~CR_SEQ_FILTER_Msk) | Seq_Filter_Select;
}

#if (LIBCFG_I2C_NOSTRETCH)
/*********************************************************************************************************//**
 * @brief This function is used to clear TXDR data.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @retval None
 ************************************************************************************************************/
void I2C_TXDRReset(HT_I2C_TypeDef* I2Cx)
{
  I2Cx->CR = (I2Cx->CR & I2C_NOSTRETCH_MASK) | I2C_NOSTRETCH_RESET;
  I2Cx->CR = (I2Cx->CR & I2C_NOSTRETCH_MASK) | I2C_NOSTRETCH_SET;
}
#endif
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
